app/controllers/articles_controller.rb

	def show
		@article = Article.find_by(id: params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def create
		@article = Article.new(article_params)
		@article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Let's try"], ["body", "shall we?  How's sthis all going...."], ["created_at", 2017-02-12 17:24:14 UTC], ["updated_at", 2017-02-12 17:24:14 UTC]]

	def destroy
		@article = Article.find_by(id: params[:id])
		@article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 1]]

	def edit
		@article = Article.find_by(id: params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def update
		@article = Article.find_by(id: params[:id])
		@article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "body" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["body", "shall we?  How's this all going...."], ["updated_at", 2017-02-12 17:24:22 UTC], ["id", 1]]