app/controllers/authors_controller.rb

INSERT INTO "authors" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", ""], ["created_at", 2017-02-12 19:25:13 UTC], ["updated_at", 2017-02-12 19:25:13 UTC]]
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save