app/controllers/comments_controller.rb

INSERT INTO "comments" ("article_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["article_id", 2], ["body", "I don't like the cut of your jibb."], ["created_at", 2017-02-12 18:24:23 UTC], ["updated_at", 2017-02-12 18:24:23 UTC]]
---
	def create
		@comment = Comment.new(comment_params)
		@comment.article_id = params[:article_id]
		@comment.save